//
// Arduono AVRアーキテクチャ用ローマ字・ひらがなテーブル(for ARDUINO_ARCH_AVR)
//

#define KW(k,s) const char k[] PROGMEM=s // キーワード定義マクロ(k:キーワード用変数名 、s:キーワード文字列)

// ローマ字
KW(r001,"a");   KW(r002,"ba");  KW(r003,"be");  KW(r004,"bi");  KW(r005,"bo");
KW(r006,"bu");  KW(r007,"bya"); KW(r008,"bye"); KW(r009,"byi"); KW(r010,"byo"); 
KW(r011,"byu"); KW(r012,"ca");  KW(r013,"ce");  KW(r014,"cha"); KW(r015,"che");
KW(r016,"chi"); KW(r017,"cho"); KW(r018,"chu"); KW(r019,"ci");  KW(r020,"co");
KW(r021,"cu");  KW(r022,"cya"); KW(r023,"cye"); KW(r024,"cyi"); KW(r025,"cyo");
KW(r026,"cyu"); KW(r027,"da");  KW(r028,"de");  KW(r029,"dha"); KW(r030,"dhe");
KW(r031,"dhi"); KW(r032,"dho"); KW(r033,"dhu"); KW(r034,"di");  KW(r035,"do");
KW(r036,"du");  KW(r037,"dya"); KW(r038,"dye"); KW(r039,"dyi"); KW(r040,"dyo");
KW(r041,"dyu"); KW(r042,"e");   KW(r043,"fa");  KW(r044,"fe");  KW(r045,"fi");
KW(r046,"fo");  KW(r047,"fu");  KW(r048,"fya"); KW(r049,"fye"); KW(r050,"fyi");
KW(r051,"fyo"); KW(r052,"fyu"); KW(r053,"ga");  KW(r054,"ge");  KW(r055,"gi");
KW(r056,"go");  KW(r057,"gu");  KW(r058,"gya"); KW(r059,"gye"); KW(r060,"gyi");
KW(r061,"gyo"); KW(r062,"gyu"); KW(r063,"ha");  KW(r064,"he");  KW(r065,"hi");
KW(r066,"ho");  KW(r067,"hu");  KW(r068,"hya"); KW(r069,"hye"); KW(r070,"hyi");
KW(r071,"hyo"); KW(r072,"hyu"); KW(r073,"i");   KW(r074,"ja");  KW(r075,"je");
KW(r076,"ji");  KW(r077,"jo");  KW(r078,"ju");  KW(r079,"jya"); KW(r080,"jye");
KW(r081,"jyi"); KW(r082,"jyo"); KW(r083,"jyu"); KW(r084,"ka");  KW(r085,"ke");
KW(r086,"ki");  KW(r087,"ko");  KW(r088,"ku");  KW(r089,"kwa"); KW(r090,"kwe");
KW(r091,"kwi"); KW(r092,"kwo"); KW(r093,"kwu"); KW(r094,"kya"); KW(r095,"kye");
KW(r096,"kyi"); KW(r097,"kyo"); KW(r098,"kyu"); KW(r099,"la");  KW(r100,"le");
KW(r101,"li");  KW(r102,"lo");  KW(r103,"ltsu");KW(r104,"ltu"); KW(r105,"lu");
KW(r106,"lya"); KW(r107,"lye"); KW(r108,"lyi"); KW(r109,"lyo"); KW(r110,"lyu");
KW(r111,"ma");  KW(r112,"me");  KW(r113,"mi");  KW(r114,"mo");  KW(r115,"mu");
KW(r116,"mya"); KW(r117,"mye"); KW(r118,"myi"); KW(r119,"myo"); KW(r120,"myu");
KW(r121,"na");  KW(r122,"ne");  KW(r123,"ni");  KW(r124,"no");  KW(r125,"nu");
KW(r126,"nwa"); KW(r127,"nwe"); KW(r128,"nwi"); KW(r129,"nwo"); KW(r130,"nwu");
KW(r131,"nya"); KW(r132,"nye"); KW(r133,"nyi"); KW(r134,"nyo"); KW(r135,"nyu");
KW(r136,"o");   KW(r137,"pa");  KW(r138,"pe");  KW(r139,"pi");  KW(r140,"po");
KW(r141,"pu");  KW(r142,"pya"); KW(r143,"pye"); KW(r144,"pyi"); KW(r145,"pyo");
KW(r146,"pyu"); KW(r147,"qa");  KW(r148,"qe");  KW(r149,"qi");  KW(r150,"qo");
KW(r151,"qu");  KW(r152,"ra");  KW(r153,"re");  KW(r154,"ri");  KW(r155,"ro");
KW(r156,"ru");  KW(r157,"rya"); KW(r158,"rye"); KW(r159,"ryi"); KW(r160,"ryo");
KW(r161,"ryu"); KW(r162,"sa");  KW(r163,"se");  KW(r164,"sha"); KW(r165,"she");
KW(r166,"shi"); KW(r167,"sho"); KW(r168,"shu"); KW(r169,"si");  KW(r170,"so");
KW(r171,"su");  KW(r172,"swa"); KW(r173,"swe"); KW(r174,"swi"); KW(r175,"swo");
KW(r176,"swu"); KW(r177,"sya"); KW(r178,"sye"); KW(r179,"syi"); KW(r180,"syo");
KW(r181,"syu"); KW(r182,"ta");  KW(r183,"te");  KW(r184,"tha"); KW(r185,"the");
KW(r186,"thi"); KW(r187,"tho"); KW(r188,"thu"); KW(r189,"ti");  KW(r190,"to");
KW(r191,"tsa"); KW(r192,"tse"); KW(r193,"tsi"); KW(r194,"tso"); KW(r195,"tsu");
KW(r196,"tu");  KW(r197,"tya"); KW(r198,"tye"); KW(r199,"tyi"); KW(r200,"tyo");
KW(r201,"tyu"); KW(r202,"u");   KW(r203,"va");  KW(r204,"ve");  KW(r205,"vi");
KW(r206,"vo");  KW(r207,"vu");  KW(r208,"vya"); KW(r209,"vye"); KW(r210,"vyi");
KW(r211,"vyo"); KW(r212,"vyu"); KW(r213,"wa");  KW(r214,"we");  KW(r215,"wha");
KW(r216,"whe"); KW(r217,"whi"); KW(r218,"who"); KW(r219,"whu"); KW(r220,"wi");
KW(r221,"wo");  KW(r222,"wu");  KW(r223,"xa");  KW(r224,"xe");  KW(r225,"xi");
KW(r226,"xo");  KW(r227,"xtsu");KW(r228,"xtu"); KW(r229,"xu");  KW(r230,"xya");
KW(r231,"xye"); KW(r232,"xyi"); KW(r233,"xyo"); KW(r234,"xyu"); KW(r235,"ya");
KW(r236,"ye");  KW(r237,"yi");  KW(r238,"yo");  KW(r239,"yu");  KW(r240,"za");
KW(r241,"ze");  KW(r242,"zi");  KW(r243,"zo");  KW(r244,"zu");  KW(r245,"zya");
KW(r246,"zye"); KW(r247,"zyi"); KW(r248,"zyo"); KW(r249,"zyu");

// かな
KW(k001,"あ");KW(k002,"ば");  KW(k003,"べ");  KW(k004,"び"); KW(k005,"ぼ");
KW(k006,"ぶ");KW(k007,"びゃ");KW(k008,"びぇ");KW(k009,"びぃ");KW(k010,"びょ");
KW(k011,"びゅ");KW(k012,"か");KW(k013,"せ");KW(k014,"ちゃ");KW(k015,"ちぇ");
KW(k016,"ち");KW(k017,"ちょ");KW(k018,"ちゅ");KW(k019,"し");KW(k020,"こ");
KW(k021,"く");KW(k022,"ちゃ");KW(k023,"ちぇ");KW(k024,"ちぃ");KW(k025,"ちょ");
KW(k026,"ちゅ");KW(k027,"だ");KW(k028,"で");KW(k029,"でゃ");KW(k030,"でぇ");
KW(k031,"でぃ");KW(k032,"でょ");KW(k033,"でゅ");KW(k034,"ぢ");KW(k035,"ど");
KW(k036,"づ");KW(k037,"ぢゃ");KW(k038,"ぢぇ");KW(k039,"ぢぃ");KW(k040,"ぢょ");
KW(k041,"ぢゅ");KW(k042,"え");KW(k043,"ふぁ");KW(k044,"ふぇ");KW(k045,"ふぃ");
KW(k046,"ふぉ");KW(k047,"ふ");KW(k048,"ふゃ");KW(k049,"ふぇ");KW(k050,"ふぃ");
KW(k051,"ふょ");KW(k052,"ふゅ");KW(k053,"が");KW(k054,"げ");KW(k055,"ぎ");
KW(k056,"ご");KW(k057,"ぐ");KW(k058,"ぎゃ");KW(k059,"ぎぇ");KW(k060,"ぎぃ");
KW(k061,"ぎょ");KW(k062,"ぎゅ");KW(k063,"は");KW(k064,"へ");KW(k065,"ひ");
KW(k066,"ほ");KW(k067,"ふ");KW(k068,"ひゃ");KW(k069,"ひぇ");KW(k070,"ひぃ");
KW(k071,"ひょ");KW(k072,"ひゅ");KW(k073,"い");KW(k074,"じゃ");KW(k075,"じぇ");
KW(k076,"じ");KW(k077,"じょ");KW(k078,"じゅ");KW(k079,"じゃ");KW(k080,"じぇ");
KW(k081,"じぃ");KW(k082,"じょ");KW(k083,"じゅ");KW(k084,"か");KW(k085,"け");
KW(k086,"き");KW(k087,"こ");KW(k088,"く");KW(k089,"くゎ");KW(k090,"くぇ");
KW(k091,"くぃ");KW(k092,"くぉ");KW(k093,"くぅ");KW(k094,"きゃ");KW(k095,"きぇ");
KW(k096,"きぃ");KW(k097,"きょ");KW(k098,"きゅ");KW(k099,"ぁ");KW(k100,"ぇ");
KW(k101,"ぃ");KW(k102,"ぉ");KW(k103,"っ");KW(k104,"っ");KW(k105,"ぅ");
KW(k106,"ゃ");KW(k107,"ぇ");KW(k108,"ぃ");KW(k109,"ょ");KW(k110,"ゅ");
KW(k111,"ま");KW(k112,"め");KW(k113,"み");KW(k114,"も");KW(k115,"む");
KW(k116,"みゃ");KW(k117,"みぇ");KW(k118,"みぃ");KW(k119,"みょ");KW(k120,"みゅ");
KW(k121,"な");KW(k122,"ね");KW(k123,"に");KW(k124,"の");KW(k125,"ぬ");
KW(k126,"ぬゎ");KW(k127,"ぬぇ");KW(k128,"ぬぃ");KW(k129,"ぬぉ");KW(k130,"ぬぅ");
KW(k131,"にゃ");KW(k132,"にぇ");KW(k133,"にぃ");KW(k134,"にょ");KW(k135,"にゅ");
KW(k136,"お");KW(k137,"ぱ");KW(k138,"ぺ");KW(k139,"ぴ");KW(k140,"ぽ");
KW(k141,"ぷ");KW(k142,"ぴゃ");KW(k143,"ぴぇ");KW(k144,"ぴぃ");KW(k145,"ぴょ");
KW(k146,"ぴゅ");KW(k147,"くぁ");KW(k148,"くぇ");KW(k149,"くぃ");KW(k150,"くぉ");
KW(k151,"く");KW(k152,"ら");KW(k153,"れ");KW(k154,"り");KW(k155,"ろ");
KW(k156,"る");KW(k157,"りゃ");KW(k158,"りぇ");KW(k159,"りぃ");KW(k160,"りょ");
KW(k161,"りゅ");KW(k162,"さ");KW(k163,"せ");KW(k164,"しゃ");KW(k165,"しぇ");
KW(k166,"し");KW(k167,"しょ");KW(k168,"しゅ");KW(k169,"し");KW(k170,"そ");
KW(k171,"す");KW(k172,"すゎ");KW(k173,"すぇ");KW(k174,"すぃ");KW(k175,"すぉ");
KW(k176,"すぅ");KW(k177,"しゃ");KW(k178,"しぇ");KW(k179,"し");KW(k180,"しょ");
KW(k181,"しゅ");KW(k182,"た");KW(k183,"て");KW(k184,"てゃ");KW(k185,"てぇ");
KW(k186,"てぃ");KW(k187,"てょ");KW(k188,"てゅ");KW(k189,"ち");KW(k190,"と");
KW(k191,"つぁ");KW(k192,"つぇ");KW(k193,"つぃ");KW(k194,"つぉ");KW(k195,"つ");
KW(k196,"つ");KW(k197,"ちゃ");KW(k198,"ちぇ");KW(k199,"ちぃ");KW(k200,"ちょ");
KW(k201,"ちゅ");KW(k202,"う");KW(k203,"ゔぁ");KW(k204,"ゔぇ");KW(k205,"ゔぃ");
KW(k206,"ゔぉ");KW(k207,"ゔ");KW(k208,"ゔゃ");KW(k209,"ゔぇ");KW(k210,"ゔぃ");
KW(k211,"ゔょ");KW(k212,"ゔゅ");KW(k213,"わ");KW(k214,"うぇ");KW(k215,"うぁ");
KW(k216,"うぇ");KW(k217,"うぃ");KW(k218,"うぉ");KW(k219,"う");KW(k220,"うぃ");
KW(k221,"を");KW(k222,"う");KW(k223,"ぁ");KW(k224,"ぇ");KW(k225,"ぃ");
KW(k226,"ぉ");KW(k227,"っ");KW(k228,"っ");KW(k229,"ぅ");KW(k230,"ゃ");
KW(k231,"ぇ");KW(k232,"ぃ");KW(k233,"ょ");KW(k234,"ゅ");KW(k235,"や");
KW(k236,"いぇ");KW(k237,"い");KW(k238,"よ");KW(k239,"ゆ");KW(k240,"ざ");
KW(k241,"ぜ");KW(k242,"じ");KW(k243,"ぞ");KW(k244,"ず");KW(k245,"じゃ");
KW(k246,"じぇ");KW(k247,"じぃ");KW(k248,"じょ");KW(k249,"じゅ");

const char* const r_table[] PROGMEM = {
  r001,  r002,  r003,  r004,  r005,  r006,  r007,  r008,  r009,  r010,
  r011,  r012,  r013,  r014,  r015,  r016,  r017,  r018,  r019,  r020,
  r021,  r022,  r023,  r024,  r025,  r026,  r027,  r028,  r029,  r030,
  r031,  r032,  r033,  r034,  r035,  r036,  r037,  r038,  r039,  r040,
  r041,  r042,  r043,  r044,  r045,  r046,  r047,  r048,  r049,  r050,
  r051,  r052,  r053,  r054,  r055,  r056,  r057,  r058,  r059,  r060,
  r061,  r062,  r063,  r064,  r065,  r066,  r067,  r068,  r069,  r070,
  r071,  r072,  r073,  r074,  r075,  r076,  r077,  r078,  r079,  r080,
  r081,  r082,  r083,  r084,  r085,  r086,  r087,  r088,  r089,  r090,
  r091,  r092,  r093,  r094,  r095,  r096,  r097,  r098,  r099,  r100,
  r101,  r102,  r103,  r104,  r105,  r106,  r107,  r108,  r109,  r110,
  r111,  r112,  r113,  r114,  r115,  r116,  r117,  r118,  r119,  r120,
  r121,  r122,  r123,  r124,  r125,  r126,  r127,  r128,  r129,  r130,
  r131,  r132,  r133,  r134,  r135,  r136,  r137,  r138,  r139,  r140,
  r141,  r142,  r143,  r144,  r145,  r146,  r147,  r148,  r149,  r150,
  r151,  r152,  r153,  r154,  r155,  r156,  r157,  r158,  r159,  r160,
  r161,  r162,  r163,  r164,  r165,  r166,  r167,  r168,  r169,  r170,
  r171,  r172,  r173,  r174,  r175,  r176,  r177,  r178,  r179,  r180,
  r181,  r182,  r183,  r184,  r185,  r186,  r187,  r188,  r189,  r190,
  r191,  r192,  r193,  r194,  r195,  r196,  r197,  r198,  r199,  r200,
  r201,  r202,  r203,  r204,  r205,  r206,  r207,  r208,  r209,  r210,
  r211,  r212,  r213,  r214,  r215,  r216,  r217,  r218,  r219,  r220,
  r221,  r222,  r223,  r224,  r225,  r226,  r227,  r228,  r229,  r230,
  r231,  r232,  r233,  r234,  r235,  r236,  r237,  r238,  r239,  r240,
  r241,  r242,  r243,  r244,  r245,  r246,  r247,  r248,  r249,
};

const char*  const h_table[] PROGMEM = {
  k001,  k002,  k003,  k004,  k005,  k006,  k007,  k008,  k009,  k010,
  k011,  k012,  k013,  k014,  k015,  k016,  k017,  k018,  k019,  k020,
  k021,  k022,  k023,  k024,  k025,  k026,  k027,  k028,  k029,  k030,
  k031,  k032,  k033,  k034,  k035,  k036,  k037,  k038,  k039,  k040,
  k041,  k042,  k043,  k044,  k045,  k046,  k047,  k048,  k049,  k050,
  k051,  k052,  k053,  k054,  k055,  k056,  k057,  k058,  k059,  k060,
  k061,  k062,  k063,  k064,  k065,  k066,  k067,  k068,  k069,  k070,
  k071,  k072,  k073,  k074,  k075,  k076,  k077,  k078,  k079,  k080,
  k081,  k082,  k083,  k084,  k085,  k086,  k087,  k088,  k089,  k090,
  k091,  k092,  k093,  k094,  k095,  k096,  k097,  k098,  k099,  k100,
  k101,  k102,  k103,  k104,  k105,  k106,  k107,  k108,  k109,  k110,
  k111,  k112,  k113,  k114,  k115,  k116,  k117,  k118,  k119,  k120,
  k121,  k122,  k123,  k124,  k125,  k126,  k127,  k128,  k129,  k130,
  k131,  k132,  k133,  k134,  k135,  k136,  k137,  k138,  k139,  k140,
  k141,  k142,  k143,  k144,  k145,  k146,  k147,  k148,  k149,  k150,
  k151,  k152,  k153,  k154,  k155,  k156,  k157,  k158,  k159,  k160,
  k161,  k162,  k163,  k164,  k165,  k166,  k167,  k168,  k169,  k170,
  k171,  k172,  k173,  k174,  k175,  k176,  k177,  k178,  k179,  k180,
  k181,  k182,  k183,  k184,  k185,  k186,  k187,  k188,  k189,  k190,
  k191,  k192,  k193,  k194,  k195,  k196,  k197,  k198,  k199,  k200,
  k201,  k202,  k203,  k204,  k205,  k206,  k207,  k208,  k209,  k210,
  k211,  k212,  k213,  k214,  k215,  k216,  k217,  k218,  k219,  k220,
  k221,  k222,  k223,  k224,  k225,  k226,  k227,  k228,  k229,  k230,
  k231,  k232,  k233,  k234,  k235,  k236,  k237,  k238,  k239,  k240,
  k241,  k242,  k243,  k244,  k245,  k246,  k247,  k248,  k249,
};
